docs/sistemaDeTrabajoPersonal.html
<!DOCTYPE html>
<html lang="es">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Cómo publicar sitios web estáticos con Emacs</title>
<meta name="author" content="Juan E. Gómez-Morantes, PhD" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content" class="content">
<header>
<h1 class="title">Cómo publicar sitios web estáticos con Emacs</h1>
</header><div id="outline-container-org6209b75" class="outline-2">
<h2 id="org6209b75">Repositorios de proyectos</h2>
<div class="outline-text-2" id="text-org6209b75">
<p>
Como ya se mencionó anteriormente, cada proyecto tiene una carpeta de activos (e.g., archivos, imágenes, documentos, notas, etc.) que son la materialización del proyecto. Esto es, no se limitan a insumos sino que también tienen resultados. Sin embargo, estos activos pueden ir cambiando durante el desarrollo del proyecto y, en ocasiones, es necesario tener un versionamiento de estos. Por ejemplo, los activos de un curso que se dicta semestre a semestre cambian en cada ejecución del curso. En lugar de tener un proyecto por semestre (con la repetición de archivos y el desperdicio de espacio de almacenamiento que esto supone), es mejor tener un repositorio Git para esto activos en donde se puedan generar ramas o versiones por semestre. De esta forma reducimos la necesidad de almacenamiento, tenemos todo en un mismo lugar, y tenemos una versión
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Fecha: 2023:03:01</p>
<p class="author">Autor: Juan E. Gómez-Morantes, PhD</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.3 (<a href="https://orgmode.org">Org</a> mode 9.8-pre)</p>
</div>
</body>
</html>
